[NoCoverage] BlockStatement
src/services/accounts.service.js:26:35
   return rows[0] || null;
 }
 
-async function listAccounts(pool) {
-  const { rows } = await pool.query(
-    "SELECT id, owner, balance, currency, status, created_at " +
-      "FROM accounts ORDER BY id ASC"
-  );
-  return rows;
-}
+async function listAccounts(pool) {}
 
 async function deposit(pool, id, amountCents) {

[NoCoverage] BlockStatement
src/services/accounts.service.js:74:24
   validateAmount(amountCents);
 
   // D-03: Validar que no sea una autotransferencia antes de operar
-  if (fromId === toId) {
-    const err = new Error("No se puede transferir a la misma cuenta");
-    err.status = 400; // Código HTTP requerido por el contrato y la especificación
-    throw err;
-  }
+  if (fromId === toId) {}
 
   // D-05: Adquirir el cliente dedicado al inicio

[NoCoverage] ConditionalExpression
src/services/accounts.service.js:74:7
   validateAmount(amountCents);
 
   // D-03: Validar que no sea una autotransferencia antes de operar
-  if (fromId === toId) {
+  if (true) {
     const err = new Error("No se puede transferir a la misma cuenta");
     err.status = 400; // Código HTTP requerido por el contrato y la especificación

[NoCoverage] StringLiteral
src/services/accounts.service.js:85:24
   
   try {
     // Iniciamos la transacción de inmediato
-    await client.query("BEGIN");
+    await client.query("");
 
     // Consultamos las cuentas usando el cliente de la transacción, no el pool general

[NoCoverage] StringLiteral
src/services/accounts.service.js:89:7
 
     // Consultamos las cuentas usando el cliente de la transacción, no el pool general
     const fromRes = await client.query(
-      "SELECT id, owner, balance, currency, status, created_at FROM accounts WHERE id = $1 FOR UPDATE", 
+      "", 
       [fromId]
     );

[NoCoverage] ArrayDeclaration
src/services/accounts.service.js:90:7
     // Consultamos las cuentas usando el cliente de la transacción, no el pool general
     const fromRes = await client.query(
       "SELECT id, owner, balance, currency, status, created_at FROM accounts WHERE id = $1 FOR UPDATE", 
-      [fromId]
+      []
     );
     const toRes = await client.query(

[NoCoverage] StringLiteral
src/services/accounts.service.js:93:7
       [fromId]
     );
     const toRes = await client.query(
-      "SELECT id, owner, balance, currency, status, created_at FROM accounts WHERE id = $1 FOR UPDATE", 
+      "", 
       [toId]
     );

[NoCoverage] ArrayDeclaration
src/services/accounts.service.js:94:7
     );
     const toRes = await client.query(
       "SELECT id, owner, balance, currency, status, created_at FROM accounts WHERE id = $1 FOR UPDATE", 
-      [toId]
+      []
     );
 

[NoCoverage] LogicalOperator
src/services/accounts.service.js:100:9
     const from = fromRes.rows[0];
     const to = toRes.rows[0];
 
-    if (!from || !to) {
+    if (!from && !to) {
       const err = new Error("Cuenta de origen o destino no encontrada");
       err.status = 404;

[NoCoverage] BooleanLiteral
src/services/accounts.service.js:106:9
       throw err;
     }
 
-    if (!canWithdraw(Number(from.balance), amountCents)) {
+    if (canWithdraw(Number(from.balance), amountCents)) {
       const err = new Error("Fondos insuficientes");
       err.status = 422;

[NoCoverage] ConditionalExpression
src/services/accounts.service.js:106:9
       throw err;
     }
 
-    if (!canWithdraw(Number(from.balance), amountCents)) {
+    if (true) {
       const err = new Error("Fondos insuficientes");
       err.status = 422;

[NoCoverage] ConditionalExpression
src/services/accounts.service.js:128:35
     const { rows } = await client.query(
       "INSERT INTO transfers (from_account, to_account, amount, reference) " +
         "VALUES ($1, $2, $3, $4) RETURNING id, from_account, to_account, amount, reference, created_at",
-      [fromId, toId, amountCents, reference || null]
+      [fromId, toId, amountCents, true]
     );
 

[NoCoverage] BlockStatement
src/services/accounts.service.js:134:19
     await client.query("COMMIT"); // Consolidar transacción
     return rows[0];
 
-  } catch (error) {
-    // Si la transacción ya había comenzado, hacemos ROLLBACK
-    try {
-      await client.query("ROLLBACK");
-    } catch (rollbackError) {
-      // Ignorar fallos de rollback si la conexión ya se había perdido
-    }
-    throw error;
-  } finally {
+  } catch (error) {} finally {
     client.release(); // Libera el cliente de vuelta al pool
   }

[NoCoverage] BlockStatement
src/services/accounts.service.js:136:9
 
   } catch (error) {
     // Si la transacción ya había comenzado, hacemos ROLLBACK
-    try {
-      await client.query("ROLLBACK");
-    } catch (rollbackError) {
+    try {} catch (rollbackError) {
       // Ignorar fallos de rollback si la conexión ya se había perdido
     }

[NoCoverage] BlockStatement
src/services/accounts.service.js:142:13
       // Ignorar fallos de rollback si la conexión ya se había perdido
     }
     throw error;
-  } finally {
-    client.release(); // Libera el cliente de vuelta al pool
-  }
+  } finally {}
 }
 

[NoCoverage] ObjectLiteral
src/services/accounts.service.js:147:18
   }
 }
 
-module.exports = {
-  createAccount,
-  getAccount,
-  listAccounts,
-  deposit,
-  withdraw,
-  transfer,
-};
+module.exports = {};
 
