[Killed] ConditionalExpression
src/services/money.js:2:7
 function toCents(amount) {
-  if (typeof amount !== "number" || Number.isNaN(amount)) {
+  if (false) {
     const err = new Error("El monto debe ser un numero");
     err.status = 400;
killedBy: money (pruebas unitarias) toCents rechaza valores no numericos
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "El monto debe ser un numero"

Received function did not throw

[Killed] BlockStatement
src/services/money.js:14:45
   return cents / 100;
 }
 
-function formatMoney(amountCents, currency) {
-  const units = amountCents / 100;
-  return `${currency} ${units.toFixed(2)}`; // Garantiza el formato estándar de dos decimales
-}
+function formatMoney(amountCents, currency) {}
 
 function validateAmount(cents) {
killedBy: money (pruebas unitarias) formatMoney presenta el importe con dos decimales y moneda
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "PEN 10.50"
Received: undefined

[Killed] ArithmeticOperator
src/services/money.js:15:17
 }
 
 function formatMoney(amountCents, currency) {
-  const units = amountCents / 100;
+  const units = amountCents * 100;
   return `${currency} ${units.toFixed(2)}`; // Garantiza el formato estándar de dos decimales
 }
killedBy: money (pruebas unitarias) formatMoney presenta el importe con dos decimales y moneda
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "PEN 10.50"
Received: "PEN 105000.00"

[Killed] ConditionalExpression
src/services/money.js:20:7
 }
 
 function validateAmount(cents) {
-  if (!Number.isInteger(cents)) {
+  if (true) {
     const err = new Error("El monto debe expresarse en centimos enteros");
     err.status = 400;
killedBy: money (pruebas unitarias) validateAmount acepta enteros positivos y rechaza el resto
statusReason: Error: El monto debe expresarse en centimos enteros

[Killed] ConditionalExpression
src/services/money.js:25:7
     err.status = 400;
     throw err;
   }
-  if (cents <= 0) {
+  if (false) {
     const err = new Error("El monto debe ser mayor que cero");
     err.status = 400;
killedBy: money (pruebas unitarias) validateAmount acepta enteros positivos y rechaza el resto
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "mayor que cero"

Received function did not throw

[Killed] BlockStatement
src/services/money.js:25:19
     err.status = 400;
     throw err;
   }
-  if (cents <= 0) {
-    const err = new Error("El monto debe ser mayor que cero");
-    err.status = 400;
-    throw err;
-  }
+  if (cents <= 0) {}
   return true;
 }
killedBy: money (pruebas unitarias) validateAmount acepta enteros positivos y rechaza el resto
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "mayor que cero"

Received function did not throw

[Killed] BlockStatement
src/services/money.js:33:49
   return true;
 }
 
-function canWithdraw(balanceCents, amountCents) {
-  return balanceCents >= amountCents;
-}
+function canWithdraw(balanceCents, amountCents) {}
 
 function applyFee(amountCents, feeBps) {
killedBy: money (pruebas unitarias) canWithdraw permite retirar exactamente el saldo disponible
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] EqualityOperator
src/services/money.js:34:10
 }
 
 function canWithdraw(balanceCents, amountCents) {
-  return balanceCents >= amountCents;
+  return balanceCents > amountCents;
 }
 
killedBy: money (pruebas unitarias) canWithdraw permite retirar exactamente el saldo disponible
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/services/money.js:42:61
   return amountCents + fee;
 }
 
-function computeInterest(balanceCents, annualRatePct, days) {
-  const daily = annualRatePct / 100 / 365;
-  return Math.round(balanceCents * daily * days);
-}
+function computeInterest(balanceCents, annualRatePct, days) {}
 
 function buildTransferReceipt({ id, fromOwner, toOwner, amountCents, currency, reference }) {
killedBy: money (pruebas unitarias) computeInterest calcula el interés simple correctamente para 30 días al 12% anual sobre 100000 céntimos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 986
Received: undefined

[Killed] ArithmeticOperator
src/services/money.js:43:17
 }
 
 function computeInterest(balanceCents, annualRatePct, days) {
-  const daily = annualRatePct / 100 / 365;
+  const daily = annualRatePct * 100 / 365;
   return Math.round(balanceCents * daily * days);
 }
killedBy: money (pruebas unitarias) computeInterest calcula el interés simple correctamente para 30 días al 12% anual sobre 100000 céntimos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 986
Received: 9863014

[Killed] ArithmeticOperator
src/services/money.js:43:17
 }
 
 function computeInterest(balanceCents, annualRatePct, days) {
-  const daily = annualRatePct / 100 / 365;
+  const daily = annualRatePct / 100 * 365;
   return Math.round(balanceCents * daily * days);
 }
killedBy: money (pruebas unitarias) computeInterest calcula el interés simple correctamente para 30 días al 12% anual sobre 100000 céntimos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 986
Received: 131400000

[Killed] ArithmeticOperator
src/services/money.js:44:21
 
 function computeInterest(balanceCents, annualRatePct, days) {
   const daily = annualRatePct / 100 / 365;
-  return Math.round(balanceCents * daily * days);
+  return Math.round(balanceCents * daily / days);
 }
 
killedBy: money (pruebas unitarias) computeInterest calcula el interés simple correctamente para 30 días al 12% anual sobre 100000 céntimos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 986
Received: 1

[Killed] ArithmeticOperator
src/services/money.js:44:21
 
 function computeInterest(balanceCents, annualRatePct, days) {
   const daily = annualRatePct / 100 / 365;
-  return Math.round(balanceCents * daily * days);
+  return Math.round(balanceCents / daily * days);
 }
 
killedBy: money (pruebas unitarias) computeInterest calcula el interés simple correctamente para 30 días al 12% anual sobre 100000 céntimos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 986
Received: 9125000000

[NoCoverage] LogicalOperator
src/services/money.js:52:16
     receiptId: id,
     summary: `${fromOwner} -> ${toOwner}`,
     amount: formatMoney(amountCents, currency),
-    reference: reference || "SIN-REFERENCIA",
+    reference: reference && "SIN-REFERENCIA",
   };
 }

[Killed] ObjectLiteral
src/services/money.js:56:18
   };
 }
 
-module.exports = {
-  toCents,
-  toUnits,
-  formatMoney,
-  validateAmount,
-  canWithdraw,
-  applyFee,
-  computeInterest,
-  buildTransferReceipt,
-};
+module.exports = {};
 
killedBy: money (pruebas unitarias) toCents convierte unidades a centimos enteros
statusReason: TypeError: toCents is not a function
